# encoding: utf-8

words = []

#["복음", "양육", "제자의 삶", "군사의 삶", "재생산의 삶"

[
  {
    :tag => "복음",
    :entries => [
      {
        :subject => "복음의 능력",
        :paragraph => "누가복음 4장 18,19절",
        :note => "주의 성령이 내게 임하셨으니 이는 가난한 자에게 복음을 전하게 하시려고 내게 기름을 부으시고 나를 보내사 포로 된 자에게 자유를, 눈 먼 자에게 다시 보게 함을 전파하며 눌린 자를 자유롭게 하고 주의 은혜의 해를 전파하게 하려 하심이라 하였더라",
        :prefix => "A-1"
      },
      {
        :subject => "복음의 능력",
        :paragraph => "로마서 1장 16절",
        :note => "내가 복음을 부끄러워하지 아니하노니 이 복음은 모든 믿는 자에게 구원을 주시는 하나님의 능력이 됨이라 먼저는 유대인에게요 그리고 헬라인에게로다",
        :prefix => "A-2"
      },
      {
        :subject => "역사의 주역",
        :paragraph => "사도행전 1장 8절",
        :note => "오직 성령이 너희에게 임하시면 너희가 권능을 받고 예루살렘과 온 유대와 사마리아와 땅 끝까지 이르러 내 증인이 되리라 하시니라",
        :prefix => "A-3"
      },
      {
        :subject => "역사의 주역",
        :paragraph => "마태복음 24장 14절",
        :note => "이 천국 복음이 모든 민족에게 증언되기 위하여 온 세상에 전파되리니 그제야 끝이 오리라",
        :prefix => "A-4"
      },
      {
        :subject => "영접",
        :paragraph => "요한복음 1장 12절",
        :note => "영접하는 자 곧 그 이름을 믿는 자들에게는 하나님의 자녀가 되는 권세를 주셨으니",
        :prefix => "A-5"
      },
      {
        :subject => "영접",
        :paragraph => "요한계시록 3장 20절",
        :note => "볼지어다 내가 문 밖에 서서 두드리노니 누구든지 내 음성을 듣고 문을 열면 내가 그에게로 들어가 그와 더불어 먹고 그는 나와 더불어 먹으리라",
        :prefix => "A-6"
      },
      {
        :subject => "풍성한 삶",
        :paragraph => "요한복음 10장 10절",
        :note => "도둑이 오는 것은 도둑질하고 죽이고 멸망시키려는 것뿐이요 내가 온 것은 양으로 생명을 얻게 하고 더 풍성히 얻게 하려는 것이라",
        :prefix => "A-7"
      },
      {
        :subject => "풍성한 삶",
        :paragraph => "갈라디아서 3장 14절",
        :note => "이는 그리스도 예수 안에서 아브라함의 복이 이방인에게 미치게 하고 또 우리로 하여금 믿음으로 말미암아 성령의 약속을 받게 하려 함이라",
        :prefix => "A-8"
      },
      {
        :subject => "복음전파",
        :paragraph => "마가복음 16장 20절",
        :note => "제자들이 나가 두루 전파할새 주께서 함께 역사하사 그 따르는 표적으로 말씀을 확실히 증언하시니라",
        :prefix => "A-9"
      },
      {
        :subject => "복음전파",
        :paragraph => "사도행전 4장 31절",
        :note => "빌기를 다하매 모인 곳이 진동하더니 무리가 다 성령이 충만하여 담대히 하나님의 말씀을 전하니라",
        :prefix => "A-10"
      },
      {
        :subject => "성령의 기름 부으심",
        :paragraph => "사도행전 10장 38절",
        :note => "하나님이 나사렛 예수에게 성령과 능력을 기름 붓듯 하셨으매 그가 두루 다니시며 선한 일을 행하시고 마귀에게 눌린 모든 사람을 고치셨으니 이는 하나님이 함께 하셨음이라",
        :prefix => "A-11"
      },
      {
        :subject => "성령의 기름 부으심",
        :paragraph => "사도행전 2장 4절",
        :note => "그들이 다 성령의 충만함을 받고 성령이 말하게 하심을 따라 다른 언어들로 말하기를 시작하니라",
        :prefix => "A-12"
      }
    ]
  },

  {
    :tag => "양육",
    :entries => [
      {
        :subject => "중심되신 그리스도",
        :paragraph => "마태복음 6장 33절",
        :note => "그런즉 너희는 먼저 그의 나라와 그의 의를 구하라 그리하면 이 모든 것을 너희에게 더하시리라",
        :prefix => "B-1"
      },
      {
        :subject => "중심되신 그리스도",
        :paragraph => "요한복음 15장 5절",
        :note => "나는 포도나무요 너희는 가지라 그가 내 안에, 내가 그 안에 거하면 사람이 열매를 많이 맺나니 나를 떠나서는 너희가 아무 것도 할 수 없음이라",
        :prefix => "B-2"
      },
      {
        :subject => "새로운 삶",
        :paragraph => "고린도후서 5장 17절",
        :note => "그런즉 누구든지 그리스도 안에 있으면 새로운 피조물이라 이전 것은 지나갔으니 보라 새 것이 되었도다",
        :prefix => "B-3"
      },
      {
        :subject => "새로운 삶",
        :paragraph => "갈라디아서 2장 20절",
        :note => "내가 그리스도와 함께 십자가에 못 박혔나니 그런즉 이제는 내가 사는 것이 아니요 오직 내 안에 그리스도께서 사시는 것이라 이제 내가 육체 가운데 사는 것은 나를 사랑하사 나를 위하여 자기 자신을 버리신 하나님의 아들을 믿는 믿음 안에서 사는 것이라",
        :prefix => "B-4"
      },
      {
        :subject => "사죄의 확신",
        :paragraph => "요한일서 1장 9절",
        :note => "만일 우리가 우리 죄를 자백하면 그는 미쁘시고 의로우사 우리 죄를 사하시며 우리를 모든 불의에서 깨끗하게 하실 것이요",
        :prefix => "B-5"
      },
      {
        :subject => "사죄의 확신",
        :paragraph => "히브리서 8장 12절",
        :note => "내가 그들의 불의를 긍휼히 여기고 그들의 죄를 다시 기억하지 아니하리라 하셨느니라",
        :prefix => "B-6"
      },
      {
        :subject => "말씀",
        :paragraph => "마태복음 4장 4절",
        :note => "예수께서 대답하여 이르시되 기록되었으되 사람이 떡으로만 살 것이 아니요 하나님의 입으로부터 나오는 모든 말씀으로 살 것이라 하였느니라 하시니",
        :prefix => "B-7"
      },
      {
        :subject => "말씀",
        :paragraph => "디모데후서 3장 16,17절",
        :note => "모든 성경은 하나님의 감동으로 된 것으로 교훈과 책망과 바르게 함과 의로 교육하기에 유익하니 이는 하나님의 사람으로 온전하게 하며 모든 선한 일을 행할 능력을 갖추게 하려 함이라",
        :prefix => "B-8"
      },
      {
        :subject => "양육",
        :paragraph => "데살로니가전서 2장 8절",
        :note => "우리가 이같이 너희를 사모하여 하나님의 복음뿐 아니라 우리의 목숨까지도 너희에게 주기를 기뻐함은 너희가 우리의 사랑하는 자 됨이라",
        :prefix => "B-9"
      },
      {
        :subject => "양육",
        :paragraph => "골로새서 1장 29절",
        :note => "이를 위하여 나도 내 속에서 능력으로 역사하시는 이의 역사를 따라 힘을 다하여 수고하노라",
        :prefix => "B-10"
      },
      {
        :subject => "성령 충만",
        :paragraph => "에베소서 5장 18절",
        :note => "술 취하지 말라 이는 방탕한 것이니 오직 성령으로 충만함을 받으라",
        :prefix => "B-11"
      },
      {
        :subject => "성령 충만",
        :paragraph => "갈라디아서 5장 22,23절",
        :note => "오직 성령의 열매는 사랑과 희락과 화평과 오래 참음과 자비와 양선과 충성과 온유와 절제니 이같은 것을 금지할 법이 없느니라",
        :prefix => "B-12"
      }
    ]
  },

  {
    :tag => "제자의 삶",
    :entries => [
      {
        :subject => "순종",
        :paragraph => "마태복음 4장 19절",
        :note => "말씀하시되 나를 따라오라 내가 너희를 사람을 낚는 어부가 되게 하리라 하시니",
        :prefix => "C-1"
      },
      {
        :subject => "순종",
        :paragraph => "히브리서 11장 8절",
        :note => "믿음으로 아브라함은 부르심을 받았을 때에 순종하여 장래의 유업으로 받을 땅에 나아갈새 갈 바를 알지 못하고 나아갔으며",
        :prefix => "C-2"
      },
      {
        :subject => "사명",
        :paragraph => "고린도전서 9장 16절",
        :note => "내가 복음을 전할지라도 자랑할 것이 없음은 내가 부득불 할 일임이라 만일 복음을 전하지 아니하면 내게 화가 있을 것이로다",
        :prefix => "C-3"
      },
      {
        :subject => "사명",
        :paragraph => "사도행전 20장 24절",
        :note => "내가 달려갈 길과 주 예수께 받은 사명 곧 하나님의 은혜의 복음을 증언하는 일을 마치려 함에는 나의 생명조차 조금도 귀한 것으로 여기지 아니하노라",
        :prefix => "C-4"
      },
      {
        :subject => "대가 지불",
        :paragraph => "누가복음 9장 23절",
        :note => "또 무리에게 이르시되 아무든지 나를 따라오려거든 자기를 부인하고 날마다 제 십자가를 지고 나를 따를 것이니라",
        :prefix => "C-5"
      },
      {
        :subject => "대가 지불",
        :paragraph => "마태복음 10장 39절",
        :note => "자기 목숨을 얻는 자는 잃을 것이요 나를 위하여 자기 목숨을 잃는 자는 얻으리라",
        :prefix => "C-6"
      },
      {
        :subject => "스승을 본받음",
        :paragraph => "빌립보서 3장 17절",
        :note => "형제들아 너희는 함께 나를 본받으라 그리고 너희가 우리를 본받은 것처럼 그와 같이 행하는 자들을 눈여겨 보라",
        :prefix => "C-7"
      },
      {
        :subject => "스승을 본받음",
        :paragraph => "고린도전서 1장 10절",
        :note => "형제들아 내가 우리 주 예수 그리스도의 이름으로 너희를 권하노니 모두가 같은 말을 하고 너희 가운데 분쟁이 없이 같은 마음과 같은 뜻으로 온전히 합하라",
        :prefix => "C-8"
      },
      {
        :subject => "섬김",
        :paragraph => "마가복음 10장 45절",
        :note => "인자가 온 것은 섬김을 받으려 함이 아니라 도리어 섬기려 하고 자기 목숨을 많은 사람의 대속물로 주려 함이니라",
        :prefix => "C-9"
      },
      {
        :subject => "섬김",
        :paragraph => "고린도전서 9장 19절",
        :note => "내가 모든 사람에게서 자유로우나 스스로 모든 사람에게 종이 된 것은 더 많은 사람을 얻고자 함이라",
        :prefix => "C-10"
      },
      {
        :subject => "그리스도의 장성한 분량",
        :paragraph => "에베소서 4장 13절",
        :note => "우리가 다 하나님의 아들을 믿는 것과 아는 일에 하나가 되어 온전한 사람을 이루어 그리스도의 장성한 분량이 충만한 데까지 이르리니",
        :prefix => "C-11"
      },
      {
        :subject => "그리스도의 장성한 분량",
        :paragraph => "에베소서 4장 15절",
        :note => "오직 사랑 안에서 참된 것을 하여 범사에 그에게까지 자랄지라 그는 머리니 곧 그리스도라",
        :prefix => "C-12"
      }
    ]
  },

  {
    :tag => "군사의 삶",
    :entries => [
      {
        :subject => "충성",
        :paragraph => "디모데후서 2장 3,4절",
        :note => "너는 그리스도 예수의 좋은 병사로 나와 함께 고난을 받으라 병사로 복무하는 자는 자기 생활에 얽매이는 자가 하나도 없나니 이는 병사로 모집한 자를 기쁘게 하려 함이라",
        :prefix => "D-1"
      },
      {
        :subject => "충성",
        :paragraph => "누가복음 16장 10절",
        :note => "지극히 작은 것에 충성된 자는 큰 것에도 충성되고 지극히 작은 것에 불의한 자는 큰 것에도 불의하니라",
        :prefix => "D-2"
      },
      {
        :subject => "거룩",
        :paragraph => "디모데후서 2장 21절",
        :note => "그러므로 누구든지 이런 것에서 자기를 깨끗하게 하면 귀히 쓰는 그릇이 되어 거룩하고 주인의 쓰심에 합당하며 모든 선한 일에 준비함이 되리라",
        :prefix => "D-3"
      },
      {
        :subject => "거룩",
        :paragraph => "디모데전서 4장 7,8절",
        :note => "망령되고 허탄한 신화를 버리고 경건에 이르도록 네 자신을 연단하라 육체의 연단은 약간의 유익이 있으나 경건은 범사에 유익하니 금생과 내생에 약속이 있느니라",
        :prefix => "D-4"
      },
      {
        :subject => "능력 무장",
        :paragraph => "마가복음 16장 17,18절",
        :note => "믿는 자들에게는 이런 표적이 따르리니 곧 그들이 내 이름으로 귀신을 쫓아내며 새 방언을 말하며 뱀을 집어올리며 무슨 독을 마실지라도 해를 받지 아니하며 병든 사람에게 손을 얹은즉 나으리라 하시더라",
        :prefix => "D-5"
      },
      {
        :subject => "능력 무장",
        :paragraph => "베드로전서 5장 8,9절",
        :note => "근신하라 깨어라 너희 대적 마귀가 우는 사자 같이 두루 다니며 삼킬 자를 찾나니 너희는 믿음을 굳건하게 하여 그를 대적하라 이는 세상에 있는 너희 형제들도 동일한 고난을 당하는 줄을 앎이라",
        :prefix => "D-6"
      },
      {
        :subject => "믿음의 선한 싸움",
        :paragraph => "디모데전서 6장 12절",
        :note => "믿음의 선한 싸움을 싸우라 영생을 취하라 이를 위하여 네가 부르심을 받았고 많은 증인 앞에서 선한 증언을 하였도다",
        :prefix => "D-7"
      },
      {
        :subject => "믿음의 선한 싸움",
        :paragraph => "에베소서 6장 12절",
        :note => "우리의 씨름은 혈과 육을 상대하는 것이 아니요 통치자들과 권세들과 이 어둠의 세상 주관자들과 하늘에 있는 악의 영들을 상대함이라",
        :prefix => "D-8"
      },
      {
        :subject => "절제",
        :paragraph => "고린도전서 9장 25절",
        :note => "이기기를 다투는 자마다 모든 일에 절제하나니 그들은 썩을 승리자의 관을 얻고자 하되 우리는 썩지 아니할 것을 얻고자 하노라",
        :prefix => "D-9"
      },
      {
        :subject => "절제",
        :paragraph => "고린도전서 9장 27절",
        :note => "내가 내 몸을 쳐 복종하게 함은 내가 남에게 전파한 후에 자신이 도리어 버림을 당할까 두려워함이로다",
        :prefix => "D-10"
      },
      {
        :subject => "하나님의 전신갑주",
        :paragraph => "에베소서 6장 10,11절",
        :note => "끝으로 너희가 주 안에서와 그 힘의 능력으로 강건하여지고 마귀의 간계를 능히 대적하기 위하여 하나님의 전신 갑주를 입으라",
        :prefix => "D-11"
      },
      {
        :subject => "하나님의 전신갑주",
        :paragraph => "에베소서 6장 13절",
        :note => "그러므로 하나님의 전신 갑주를 취하라 이는 악한 날에 너희가 능히 대적하고 모든 일을 행한 후에 서기 위함이라",
        :prefix => "D-12"
      }
    ]
  },

  {
    :tag => "재생산의 삶",
    :entries => [
      {
        :subject => "재생산",
        :paragraph => "디모데후서 2장 2절",
        :note => "또 네가 많은 증인 앞에서 내게 들은 바를 충성된 사람들에게 부탁하라 그들이 또 다른 사람들을 가르칠 수 있으리라",
        :prefix => "E-1"
      },
      {
        :subject => "재생산",
        :paragraph => "빌립보서 4장 9절",
        :note => "너희는 내게 배우고 받고 듣고 본 바를 행하라 그리하면 평강의 하나님이 너희와 함께 계시리라",
        :prefix => "E-2"
      },
      {
        :subject => "세계비전",
        :paragraph => "마가복음 16장 15절",
        :note => "또 이르시되 너희는 온 천하에 다니며 만민에게 복음을 전파하라",
        :prefix => "E-3"
      },
      {
        :subject => "세계비전",
        :paragraph => "마태복음 28장 18~20절",
        :note => "예수께서 나아와 말씀하여 이르시되 하늘과 땅의 모든 권세를 내게 주셨으니 그러므로 너희는 가서 모든 민족을 제자로 삼아 아버지와 아들과 성령의 이름으로 세례를 베풀고 내가 너희에게 분부한 모든 것을 가르쳐 지키게 하라 볼지어다 내가 세상 끝날까지 너희와 항상 함께 있으리라 하시니라",
        :prefix => "E-4"
      },
      {
        :subject => "추수할 일꾼",
        :paragraph => "마태복음 9장 38절",
        :note => "그러므로 추수하는 주인에게 청하여 추수할 일꾼들을 보내 주소서 하라 하시니라",
        :prefix => "E-5"
      },
      {
        :subject => "추수할 일꾼",
        :paragraph => "로마서 16장 4절",
        :note => "그들은 내 목숨을 위하여 자기들의 목까지도 내놓았나니 나뿐 아니라 이방인의 모든 교회도 그들에게 감사하느니라",
        :prefix => "E-6"
      },
      {
        :subject => "하나님 나라",
        :paragraph => "마태복음 13장 33절",
        :note => "또 비유로 말씀하시되 천국은 마치 여자가 가루 서 말 속에 갖다 넣어 전부 부풀게 한 누룩과 같으니라",
        :prefix => "E-7"
      },
      {
        :subject => "하나님 나라",
        :paragraph => "마태복음 13장 44절",
        :note => "천국은 마치 밭에 감추인 보화와 같으니 사람이 이를 발견한 후 숨겨 두고 기뻐하며 돌아가서 자기의 소유를 다 팔아 그 밭을 사느니라",
        :prefix => "E-8"
      },
      {
        :subject => "배가번식",
        :paragraph => "창세기 1장 28절",
        :note => "하나님이 그들에게 복을 주시며 하나님이 그들에게 이르시되 생육하고 번성하여 땅에 충만하라, 땅을 정복하라, 바다의 물고기와 하늘의 새와 땅에 움직이는 모든 생물을 다스리라 하시니라",
        :prefix => "E-9"
      },
      {
        :subject => "배가번식",
        :paragraph => "요한복음 15장 8절",
        :note => "너희가 열매를 많이 맺으면 내 아버지께서 영광을 받으실 것이요 너희는 내 제자가 되리라",
        :prefix => "E-10"
      },
      {
        :subject => "천국 상급",
        :paragraph => "다니엘 12장 3절",
        :note => "지혜 있는 자는 궁창의 빛과 같이 빛날 것이요 많은 사람을 옳은 데로 돌아오게 한 자는 별과 같이 영원토록 빛나리라",
        :prefix => "E-11"
      },
      {
        :subject => "천국 상급",
        :paragraph => "디모데후서 4장 8절",
        :note => "이제 후로는 나를 위하여 의의 면류관이 예비되었으므로 주 곧 의로우신 재판장이 그 날에 내게 주실 것이며 내게만 아니라 주의 나타나심을 사모하는 모든 자에게도니라",
        :prefix => "E-12"
      }
    ]
  }

].each do |item|
  tag = item[:tag]
  item[:entries].each_with_index do |word, idx|
    #Word.create(word.merge(:tag => item['tag'], :memorized => 0, :priority => idx + 1))
    words << word.merge(:tag => item[:tag], :memorized => 0, :priority => idx + 1)
  end
end

Word.create(words)

